In [2]:
import numpy as np
a = np.array([1, None, 3, 4])
a

array([1, None, 3, 4], dtype=object)

In [11]:
a = np.array([1, np.nan, 3, 4])
a
a + 1

array([ 2., nan,  4.,  5.])

In [12]:
a.sum()

nan

In [13]:
a.min(),a.max()

(nan, nan)

In [17]:
np.nansum(a),np.nanmin(a),np.nanmax(a)

(8.0, 1.0, 4.0)

In [19]:
import pandas as pd
b = pd.Series([1,2,np.nan,4,None,6])
b
c = pd.DataFrame([[1,np.nan,3], [4,5,6], [np.nan,8,9]])
c

     0    1  2
0  1.0  NaN  3
1  4.0  5.0  6
2  NaN  8.0  9

In [20]:
b.sum()

13.0

In [21]:
b

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
5    6.0
dtype: float64

In [22]:
b.isnull()

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [23]:
b.notnull()

0     True
1     True
2    False
3     True
4    False
5     True
dtype: bool

In [25]:
b[b.notnull()]

0    1.0
1    2.0
3    4.0
5    6.0
dtype: float64

In [29]:
c.dropna(axis=1, how='all')

     0    1  2
0  1.0  NaN  3
1  4.0  5.0  6
2  NaN  8.0  9

In [30]:
c.dropna(thresh=3)

     0    1  2
1  4.0  5.0  6

In [31]:
b.fillna(1)

0    1.0
1    2.0
2    1.0
3    4.0
4    1.0
5    6.0
dtype: float64

In [32]:
b.fillna(b.mean())

0    1.00
1    2.00
2    3.25
3    4.00
4    3.25
5    6.00
dtype: float64

In [33]:
b.fillna(method='ffill')

0    1.0
1    2.0
2    2.0
3    4.0
4    4.0
5    6.0
dtype: float64

In [34]:
b.fillna(method='bfill')

0    1.0
1    2.0
2    4.0
3    4.0
4    6.0
5    6.0
dtype: float64

In [36]:
c.fillna(method='bfill', axis=1)

     0    1    2
0  1.0  3.0  3.0
1  4.0  5.0  6.0
2  8.0  8.0  9.0

In [37]:
c.fillna({0:0.5, 1:1})

     0    1  2
0  1.0  1.0  3
1  4.0  5.0  6
2  0.5  8.0  9

In [38]:
b2 = b.copy()

In [39]:
b2

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
5    6.0
dtype: float64

In [40]:
b2.fillna(0, inplace=True)

In [41]:
b2

0    1.0
1    2.0
2    0.0
3    4.0
4    0.0
5    6.0
dtype: float64

In [47]:
c.loc[3] = np.nan
c

     0    1    2
0  1.0  NaN  3.0
1  NaN  5.0  6.0
2  NaN  8.0  9.0
3  NaN  NaN  NaN

In [48]:
c.loc[1:3, 0] = np.nan

In [49]:
c

     0    1    2
0  1.0  NaN  3.0
1  NaN  5.0  6.0
2  NaN  8.0  9.0
3  NaN  NaN  NaN

In [50]:
c.fillna(method='ffill', limit=2)

     0    1    2
0  1.0  NaN  3.0
1  1.0  5.0  6.0
2  1.0  8.0  9.0
3  NaN  8.0  9.0

In [73]:
data = pd.Series([1, -999, 2,-999,-1000,3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [56]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [70]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [71]:
data.replace([-999, -1000],[np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [77]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [87]:
a = pd.DataFrame([['鬃刷','皮带','煎蛋','观赏'], [10,20,30,40]]).T
b = {'鬃刷':'猪','皮带':'牛','毛衣':'羊','观赏':'鱼'}
a[0].map(b)

0      猪
1      牛
2    NaN
3      鱼
Name: 0, dtype: object

In [92]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), index=['ming','hua','bai'], columns=['one','two','three','four'])
data
data.rename(index={'ming':'HEI'}, columns={'two':'ttt','four':'fff'})
data.rename(index={'ming':'HEI'}, columns={'two':'ttt','four':'fff'},inplace=True)
data

     one  ttt  three  fff
HEI    0    1      2    3
hua    4    5      6    7
bai    8    9     10   11